src/fluid_scientist/templates/openfoam13/laminar_pipe/constant/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
simulationType laminar;
