src/fluid_scientist/templates/openfoam13/laminar_pipe/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
viscosityModel  constant;
nu              [0 2 -1 0 0 0 0] {{nu}};
